tests/resources/cassettes/test_successful_payment.yaml

interactions:
- request:
    body: '{"biller_id": 40, "account_number": "501000000007"}'
    headers:
      Accept: [application/vnd.regalii.v3.1+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:V/x47XqoiMG3DA0lI2Ld8Yl5bYg=']
      Connection: [keep-alive]
      Content-Length: ['51']
      Content-MD5: [PtZUYQ9bmh3ULNV0W7ZNdw==]
      Content-Type: [application/json]
      Date: ['Fri, 15 Feb 2019 00:13:48 GMT']
      User-Agent: [python-requests/2.21.0]
    method: POST
    uri: https://api.casiregalii.com/bills
  response:
    body: {string: '{"type":"bill","id":8390,"biller_id":40,"account_number":"501000000007","name_on_account":null,"due_date":null,"balance":549.0,"balance_currency":"MXN","balance_updated_at":"2019-02-15T00:13:49Z","error_code":null,"error_message":null,"status":"linked","migrated_at":null,"mfa_challenges":[]}'}
    headers:
      Cache-Control: ['max-age=0, private, must-revalidate']
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Fri, 15 Feb 2019 00:13:50 GMT']
      ETag: [W/"6a31951a120c27635dd1c259ab26047b"]
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [03142527-970a-497e-a668-33e4fff5a25e]
      X-Runtime: ['1.047509']
      X-XSS-Protection: [1; mode=block]
    status: {code: 200, message: OK}
- request:
    body: '{}'
    headers:
      Accept: [application/vnd.regalii.v3.1+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:QZbRvPJIHLARQy9CZSUDtlJAsYc=']
      Connection: [keep-alive]
      Content-Length: ['2']
      Content-MD5: [mZFLkyvTelC5g8XnyQrpOw==]
      Content-Type: [application/json]
      Date: ['Fri, 15 Feb 2019 00:13:50 GMT']
      User-Agent: [python-requests/2.21.0]
    method: GET
    uri: https://api.casiregalii.com/bills/8390
  response:
    body: {string: '{"type":"bill","id":8390,"biller_id":40,"account_number":"501000000007","name_on_account":null,"due_date":null,"balance":549.0,"balance_currency":"MXN","balance_updated_at":"2019-02-15T00:13:49Z","error_code":null,"error_message":null,"status":"linked","migrated_at":null,"mfa_challenges":[]}'}
    headers:
      Cache-Control: ['max-age=0, private, must-revalidate']
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Fri, 15 Feb 2019 00:13:50 GMT']
      ETag: [W/"6a31951a120c27635dd1c259ab26047b"]
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [f081fa1d-9e2f-436e-a06f-b511481a3a1c]
      X-Runtime: ['0.024568']
      X-XSS-Protection: [1; mode=block]
    status: {code: 200, message: OK}
- request:
    body: '{"amount": 549.0, "currency": "MXN"}'
    headers:
      Accept: [application/vnd.regalii.v3.1+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:K2XdtH090NKswzRk1QU7hPlEVkY=']
      Connection: [keep-alive]
      Content-Length: ['36']
      Content-MD5: [ze1WRUVApUnpFxTpAr7ygw==]
      Content-Type: [application/json]
      Date: ['Fri, 15 Feb 2019 00:13:50 GMT']
      User-Agent: [python-requests/2.21.0]
    method: POST
    uri: https://api.casiregalii.com/bills/8390/pay
  response:
    body: {string: '{"type":"transaction","id":48240,"amount":549.0,"amount_currency":"MXN","fx_rate":1.0,"amount_usd":28.27,"transaction_fee":3.0,"total_usd":28.43,"hours_to_fulfill":0,"created_at":"2019-02-15T00:13:50Z","status":"fulfilled"}'}
    headers:
      Cache-Control: ['max-age=0, private, must-revalidate']
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Fri, 15 Feb 2019 00:13:51 GMT']
      ETag: [W/"ef5e8f388123cc164f5f26f4649d9c43"]
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [715cc559-8c90-4e3c-a512-1796d0dd49be]
      X-Runtime: ['0.074175']
      X-XSS-Protection: [1; mode=block]
    status: {code: 201, message: Created}
version: 1
