tests/resources/cassettes/test_limit_payments.yaml

interactions:
- request:
    body: '{"biller_id": 40, "account_number": "501000000007"}'
    headers:
      Accept:
      - application/vnd.regalii.v3.1+json
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - APIAuth 88879c1b066dc9aea6201f27be2bbba9:Jh9ADDlc+ZcHdrwlgPHoIwUMh8o=
      Connection:
      - keep-alive
      Content-Length:
      - '51'
      Content-MD5:
      - PtZUYQ9bmh3ULNV0W7ZNdw==
      Content-Type:
      - application/json
      Date:
      - Tue, 03 Sep 2019 01:53:47 GMT
      User-Agent:
      - python-requests/2.21.0
    method: POST
    uri: https://api.casiregalii.com/bills
  response:
    body:
      string: '{"type":"bill","id":8390,"biller_id":40,"account_number":"501000000007","name_on_account":null,"due_date":"2019-09-03T00:00:00Z","balance":-10.0,"balance_currency":"MXN","balance_updated_at":"2019-09-03T01:53:48Z","error_code":null,"error_message":null,"status":"linked","migrated_at":null,"mfa_challenges":[]}'
    headers:
      Cache-Control:
      - max-age=0, private, must-revalidate
      Connection:
      - keep-alive
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Tue, 03 Sep 2019 01:53:49 GMT
      ETag:
      - W/"4b0d86fa68ccc60457f44db86c9e106c"
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Transfer-Encoding:
      - chunked
      X-Request-Id:
      - a8dfd6f5-3d80-4dd0-9f86-7c398e6a5e7b
      X-Runtime:
      - '1.641670'
    status:
      code: 200
      message: OK
- request:
    body: '{"amount": -10.0, "currency": "MXN"}'
    headers:
      Accept:
      - application/vnd.regalii.v3.1+json
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - APIAuth 88879c1b066dc9aea6201f27be2bbba9:hQNyc2O77NQWzx/yVs/0OwDguMg=
      Connection:
      - keep-alive
      Content-Length:
      - '36'
      Content-MD5:
      - mg1MPY2yXLf8n26ugdpxLw==
      Content-Type:
      - application/json
      Date:
      - Tue, 03 Sep 2019 01:53:49 GMT
      User-Agent:
      - python-requests/2.21.0
    method: POST
    uri: https://api.casiregalii.com/bills/8390/pay
  response:
    body:
      string: '{"code":"R45","message":"The maximum number of payments for this account on this day was reached"}'
    headers:
      Cache-Control:
      - no-cache
      Connection:
      - keep-alive
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Tue, 03 Sep 2019 01:53:50 GMT
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Transfer-Encoding:
      - chunked
      X-Request-Id:
      - ccc821e2-7548-4ab8-aadf-d96f29e2be75
      X-Runtime:
      - '0.021292'
    status:
      code: 400
      message: Bad Request
version: 1
